Show / Hide Table of Contents
Enum HangingType
Type of hanging
Namespace: IdeaRS.OpenModel.Detail
Assembly: IdeaRS.OpenModel.dll
Syntax
public enum HangingType
Fields
 Name |  Description
 AngleAnchorLShapedBranches
Angle anchor with L-shaped branches _/_
 AngleAnchorStraightBranches
Angle anchor with straight branches /\
 StraightAnchorLShapedBranches
Straight anchor with L-shaped branches
 StraightAnchorSingleBar
Straight single bar
 StraightAnchorStraightBranches
Straight anchor with straight branches
 Improve this Doc
 View Source